[
  {
    "duration": "January 2023 - Now",
    "designation": "IT and Process Specialist",
    "company": "Allianz Technology",
    "logo": "allianz.png",
    "location": "Barcelona, Spain",
    "projects": [
      {
        "role": "Full Stack Developer",
        "name": "Internal Project",
        "description": [
          "Developing an enterprise application for internal use within the organization.",
          "Features are modular and can be enabled or disabled via configuration.",
          "The application is configurable to meet the needs of vendors across different European countries."
        ],
        "techStack": [
          "Angular",
          "Spring Boot",
          "Kafka",
          "Postgres",
          "SAML",
          "Jenkins",
          "Allianz Tools"
        ]
      }
    ]
  },
  {
    "duration": "May 2022 - December 2023",
    "designation": "Senior Consultant",
    "company": "Deloitte Digital",
    "logo": "deloitte.svg",
    "location": "Bangalore, India",
    "projects": [
      {
        "role": "Full Stack Developer",
        "name": "Customer Care Backlog Management Tool",
        "description": [
          "A cron job periodically fetches data from SAP HANA via a Lambda function and stores it in a PostgreSQL database.",
          "An Express app with Prisma ORM serves data through a GraphQL API.",
          "Users are authenticated using Okta SAML and their details are fetched from employee database.",
          "A React web app displays the data and various analytics.",
          "This application replaced multiple legacy apps and processes across different regions."
        ],
        "techStack": [
          "React",
          "Material-UI",
          "Prisma",
          "GraphQL",
          "NodeJS",
          "Octa SAML",
          "RDS/Postgres",
          "Docker",
          "Teamcity",
          "Kubernetes",
          "AWS Lambda"
        ]
      }
    ]
  },
  {
    "duration": "May 2018 – April 2021",
    "designation": "Consultant",
    "company": "Deloitte Digital",
    "logo": "deloitte.svg",
    "location": "Bangalore, India",
    "projects": [
      {
        "name": "Ecommerce Application",
        "role": "Full Stack Developer",
        "description": [
          "Developed an online marketplace for a US-based MNC specializing in life-science products.",
          "Integrated CyberSource API for payments and Elastic Path for product searches."
        ],
        "techStack": [
          "Angular",
          "SASS",
          "NodeJS",
          "CyberSource",
          "Elastic Path"
        ]
      },
      {
        "name": "Quoting tool",
        "role": "Frontend Developer",
        "description": [
          "Created a quote generation tool for consumption-based IT solutions.",
          "Backend services were developed using SAP Hybris, with React used on the client side."
        ],
        "techStack": [
          "Hybris",
          "React",
          "SASS"
        ]
      },
      {
        "name": "Production Lines Tracker",
        "role": "Full Stack Developer",
        "description": [
          "Developed a complete IoT solution for end-to-end monitoring of production lines in a manufacturing unit.",
          "Utilized the Thingworx IoT platform to collect, process, and store data from on-site sensors, displaying real-time information.",
          "Integrated React with Thingworx, significantly reducing project development time."
        ],
        "techStack": [
          "Thingworx",
          "React",
          "jQuery",
          "JSS"
        ]
      },
      {
        "name": "Dynamic Vehicle Router",
        "role": "Full Stack Developer",
        "description": [
          "Developed a solution to optimize delivery routes for vehicles visiting multiple stores.",
          "Users can input constraints and receive a list of customized routes.",
          "The selected route is tracked on a map for the driver to follow."
        ],
        "techStack": [
          "Python",
          "React",
          "Redux",
          "NodeJS"
        ]
      }
    ]
  },
  {
    "duration": "August 2016 – April 2018",
    "designation": "Business Technology Analyst",
    "company": "Deloitte Digital",
    "logo": "deloitte.svg",
    "location": "Bangalore, India",
    "projects": [
      {
        "name": "Citizen's Services Portal",
        "role": "Full Stack Developer",
        "description": [
          "The project offers a digital platform for citizens to access government services.",
          "A React component library includes reusable components, which are assembled to create various views and pages.",
          "The front-end application features hundreds of forms, dynamically generated from JSON files."
        ],
        "techStack": [
          "React",
          "Redux",
          "NodeJS",
          "JSS"
        ]
      },
      {
        "name": "Virtual Health Assistant",
        "role": "Full Stack Developer",
        "description": [
          "The app has 3 layers – Client built with Angular, Socket layer - a service that listens for incoming requests and Node layer which intercepts socket requests, processes data or makes service calls, and returns the results to the client for injection.",
          "The app supports three languages with different requirements, using a single codebase.",
          "The entire app is configurable via a config file, allowing changes without rebuilding the app.",
          "All data is hosted on a CMS."
        ],
        "techStack": [
          "Angular 9",
          "Node",
          "Pug",
          "SASS",
          "Socket.io"
        ]
      }
    ]
  },
  {
    "duration": "2014 – 2016",
    "designation": "Consultant & Developer",
    "company": "Cretechs",
    "logo": "cretechs.svg",
    "location": "Bangalore, India",
    "projects": [
      {
        "name": "iRelief Medical Services",
        "role": "Full Stack Developer",
        "description": [
          "The app allowed users to book ambulance in realtime, find donors & blood banks, book homecare services and order medicines online.",
          "The solution included APIs, a back-office dashboard, a user website, a driver mobile app, and a user app.",
          "The driver's mobile app could receive bookings, complete journeys, and generate invoices, similar to Uber.",
          "Developed the backend in Django, using Celery as the task scheduler, Firebase for real-time database, and GCM for push notifications to mobile apps."
        ],
        "techStack": [
          "Django",
          "Celery",
          "Firebase",
          "GCM",
          "Angular 5",
          "NodeJS",
          "Geolocation API"
        ]
      },
      {
        "name": "Mojojo",
        "role": "Full Stack Developer",
        "description": [
          "MOJOJO is a marketplace connecting people with salons, spas, tattoo studios & stylists.",
          "The application includes an AngularJS website, a dashboard, a Laravel backend, and Redis cache.",
          "It also offers a dashboard for stylists and spas to manage booking calendar."
        ],
        "techStack": [
          "Laravel",
          "AngularJS",
          "MySQL",
          "Redis"
        ]
      },
      {
        "name": "Malvern Engineering",
        "role": "Full Stack Developer",
        "description": [
          "Created a WordPress website for Malvern Engineering, a company serving the mining industry.",
          "Developed a custom WordPress plugin that allows users to submit their email addresses while downloading product brochures."
        ],
        "techStack": [
          "Wordpress",
          "PHP",
          "JavaScript",
          "MySQL"
        ]
      }
    ]
  }
]
